JuaBue/S32K144_basic/include/driver/S32K_GPIO.h
/*
 * S32K_PLL.h
 *
 *  Created on: 30 mar. 2025
 *      Author: Juan.Bueno
 */

#ifndef S32K_GPIO_H_
#define S32K_GPIO_H_

// Define pin status
typedef enum GPIO_CFG
{
    // The value here cannot be changed!!!
	GPI         = 0x00,	// Define the pin input direction. In GPIOx_PDDRn, 0 means input and 1 means output.
	GPO         = 0x01,	// Define the pin output direction

	GPI_DOWN    = 0x02,	// Input pull-down PORTx_PCRn requires PE=1, PS=0
	GPI_UP      = 0x03,	// Input pull-up PORTx_PCRn requires PE=1, PS=1
	GPI_PF      = 0x10,	// Input, with passive filter, filter range: 10 MHz ~ 30 MHz. Does not support high-speed interface (>=2MHz) 0b10000           Passive Filter Enable
	GPI_DOWN_PF = GPI_DOWN | GPI_PF ,		// Input pull-down with passive filter
	GPI_UP_PF   = GPI_UP   | GPI_PF ,		// Input pull-up with passive filter

	GPO_HDS     = 0x41,	// Output high drive strength 0b100 0001 High drive strength
	GPO_SSR     = 0x05,	// Output slow change rate 0b101 Slow slew rate
	GPO_HDS_SSR = GPO_HDS | GPO_SSR,	// Output high drive capability, slow change rate
} GPIO_CFG;		// The lowest bit is 0, which means it is definitely input; the lowest bit of GPI_UP and GPI_UP_PF is 1, and the others are output


// Define pin external interrupt trigger mode
typedef enum exti_cfg
{
    rising_DMA      = 0x01,     // Rising edge triggers DMA interrupt
    falling_DMA     = 0x02,     // Falling edge triggers DMA interrupt
    either_down_DMA = 0x03,     // DMA interrupt triggered by edge transition

    // Use the highest bit to mark pull-up and pull-down
    zero_down       = 0x08u,    // Low level trigger, internal pull-down
    rising_down     = 0x09u,    // Rising edge trigger, internal pull-down
    falling_down    = 0x0Au,    // Falling edge triggered, internal pull-down
    either_down     = 0x0Bu,    // Edge trigger, internal pull-down
    one_down        = 0x0Cu,    // High level trigger, internal pull-down

    // Use the highest bit to mark pull-up and pull-down
    zero_up         = 0x88u,    // Low level trigger, internal pull-up
    rising_up       = 0x89u,    // Rising edge trigger, internal pull-up
    falling_up      = 0x8Au,    // Falling edge triggered, internal pull-up
    either_up       = 0x8Bu,    // Edge trigger, internal pull-up
    one_up          = 0x8Cu     // High level trigger, internal pull-up
} exti_cfg;

extern GPIO_MemMapPtr GPIOX[5];
extern PORT_MemMapPtr PORTX[5];

#define GPIOX_BASE(PTxn)    GPIOX[PTX(PTxn)] // GPIO module address
#define PORTX_BASE(PTxn)    PORTX[PTX(PTxn)] // PORT module address


/*********************** GPIO Function **************************/

/* @brief GPIO initialization
 * @param ptx_n: pin number defined in common.h
 * @param dir: pin status (pull-up/pull-down, input/output, etc.)
 * @param data: pin output level 0: low level 1: high level
 */
void GPIO_PinInit(PTXn_e ptx_n, GPIO_CFG dir, uint8_t data);


/* @brief Set IO direction
 * @param ptx_n: pin number defined in common.h
 * @param input: GPIO direction true: input false: output
 */
void GPIO_PinSetDir(PTXn_e ptx_n, bool input);


/* @brief Set IO port output
 * @param ptx_n: GPIO to be initialized, defined in common.h
 * @param data: 1: high level 0: low level
 */
void GPIO_PinWrite(PTXn_e ptx_n, uint8_t data);


/* @brief Flip IO port output
 * @param ptx_n: GPIO to be initialized, defined in common.h
 */
void GPIO_PinReverse(PTXn_e ptx_n);


/* @brief Get IO port level
 * @param ptx_n: GPIO to be initialized, defined in common.h
 * @return 0: low level 1: high level
 */
uint8_t GPIO_PinRead(PTXn_e ptx_n);


/* @brief IO pull-up
 * @param ptx_n select port
 * @param pullup_ena false: pulldown, true: pullup
 */
void GPIO_PortPull(PTXn_e ptx_n, bool pullup_ena);


/* @brief GPIO external interrupt initialization
 * @param ptx_n: GPIO to be initialized, defined in common.h
 * @param cfg: interrupt trigger mode, such as: rising_down // rising edge trigger, internal pull-down
 * @note Here only the peripheral interrupt is enabled, and NVIC_EnableIRQ() is also required to enable the kernel interrupt
 */
void GPIO_ExtiInit(PTXn_e ptx_n, exti_cfg cfg);


/* Bit operation macro definition */
/* Define the port of PTA */
#define PTA0_OUT     PTA_BASE_PTR->PDORs.PDOR0
#define PTA1_OUT     PTA_BASE_PTR->PDORs.PDOR1
#define PTA2_OUT     PTA_BASE_PTR->PDORs.PDOR2
#define PTA3_OUT     PTA_BASE_PTR->PDORs.PDOR3
#define PTA4_OUT     PTA_BASE_PTR->PDORs.PDOR4
#define PTA5_OUT     PTA_BASE_PTR->PDORs.PDOR5
#define PTA6_OUT     PTA_BASE_PTR->PDORs.PDOR6
#define PTA7_OUT     PTA_BASE_PTR->PDORs.PDOR7
#define PTA8_OUT     PTA_BASE_PTR->PDORs.PDOR8
#define PTA9_OUT     PTA_BASE_PTR->PDORs.PDOR9
#define PTA10_OUT    PTA_BASE_PTR->PDORs.PDOR10
#define PTA11_OUT    PTA_BASE_PTR->PDORs.PDOR11
#define PTA12_OUT    PTA_BASE_PTR->PDORs.PDOR12
#define PTA13_OUT    PTA_BASE_PTR->PDORs.PDOR13
#define PTA14_OUT    PTA_BASE_PTR->PDORs.PDOR14
#define PTA15_OUT    PTA_BASE_PTR->PDORs.PDOR15
#define PTA16_OUT    PTA_BASE_PTR->PDORs.PDOR16
#define PTA17_OUT    PTA_BASE_PTR->PDORs.PDOR17
#define PTA18_OUT    PTA_BASE_PTR->PDORs.PDOR18
#define PTA19_OUT    PTA_BASE_PTR->PDORs.PDOR19
#define PTA20_OUT    PTA_BASE_PTR->PDORs.PDOR20
#define PTA21_OUT    PTA_BASE_PTR->PDORs.PDOR21
#define PTA22_OUT    PTA_BASE_PTR->PDORs.PDOR22
#define PTA23_OUT    PTA_BASE_PTR->PDORs.PDOR23
#define PTA24_OUT    PTA_BASE_PTR->PDORs.PDOR24
#define PTA25_OUT    PTA_BASE_PTR->PDORs.PDOR25
#define PTA26_OUT    PTA_BASE_PTR->PDORs.PDOR26
#define PTA27_OUT    PTA_BASE_PTR->PDORs.PDOR27
#define PTA28_OUT    PTA_BASE_PTR->PDORs.PDOR28
#define PTA29_OUT    PTA_BASE_PTR->PDORs.PDOR29
#define PTA30_OUT    PTA_BASE_PTR->PDORs.PDOR30
#define PTA31_OUT    PTA_BASE_PTR->PDORs.PDOR31

/* Define the port of PTB */
#define PTB0_OUT     PTB_BASE_PTR->PDORs.PDOR0
#define PTB1_OUT     PTB_BASE_PTR->PDORs.PDOR1
#define PTB2_OUT     PTB_BASE_PTR->PDORs.PDOR2
#define PTB3_OUT     PTB_BASE_PTR->PDORs.PDOR3
#define PTB4_OUT     PTB_BASE_PTR->PDORs.PDOR4
#define PTB5_OUT     PTB_BASE_PTR->PDORs.PDOR5
#define PTB6_OUT     PTB_BASE_PTR->PDORs.PDOR6
#define PTB7_OUT     PTB_BASE_PTR->PDORs.PDOR7
#define PTB8_OUT     PTB_BASE_PTR->PDORs.PDOR8
#define PTB9_OUT     PTB_BASE_PTR->PDORs.PDOR9
#define PTB10_OUT    PTB_BASE_PTR->PDORs.PDOR10
#define PTB11_OUT    PTB_BASE_PTR->PDORs.PDOR11
#define PTB12_OUT    PTB_BASE_PTR->PDORs.PDOR12
#define PTB13_OUT    PTB_BASE_PTR->PDORs.PDOR13
#define PTB14_OUT    PTB_BASE_PTR->PDORs.PDOR14
#define PTB15_OUT    PTB_BASE_PTR->PDORs.PDOR15
#define PTB16_OUT    PTB_BASE_PTR->PDORs.PDOR16
#define PTB17_OUT    PTB_BASE_PTR->PDORs.PDOR17
#define PTB18_OUT    PTB_BASE_PTR->PDORs.PDOR18
#define PTB19_OUT    PTB_BASE_PTR->PDORs.PDOR19
#define PTB20_OUT    PTB_BASE_PTR->PDORs.PDOR20
#define PTB21_OUT    PTB_BASE_PTR->PDORs.PDOR21
#define PTB22_OUT    PTB_BASE_PTR->PDORs.PDOR22
#define PTB23_OUT    PTB_BASE_PTR->PDORs.PDOR23
#define PTB24_OUT    PTB_BASE_PTR->PDORs.PDOR24
#define PTB25_OUT    PTB_BASE_PTR->PDORs.PDOR25
#define PTB26_OUT    PTB_BASE_PTR->PDORs.PDOR26
#define PTB27_OUT    PTB_BASE_PTR->PDORs.PDOR27
#define PTB28_OUT    PTB_BASE_PTR->PDORs.PDOR28
#define PTB29_OUT    PTB_BASE_PTR->PDORs.PDOR29
#define PTB30_OUT    PTB_BASE_PTR->PDORs.PDOR30
#define PTB31_OUT    PTB_BASE_PTR->PDORs.PDOR31

/* Define the port of PTC */
#define PTC0_OUT     PTC_BASE_PTR->PDORs.PDOR0
#define PTC1_OUT     PTC_BASE_PTR->PDORs.PDOR1
#define PTC2_OUT     PTC_BASE_PTR->PDORs.PDOR2
#define PTC3_OUT     PTC_BASE_PTR->PDORs.PDOR3
#define PTC4_OUT     PTC_BASE_PTR->PDORs.PDOR4
#define PTC5_OUT     PTC_BASE_PTR->PDORs.PDOR5
#define PTC6_OUT     PTC_BASE_PTR->PDORs.PDOR6
#define PTC7_OUT     PTC_BASE_PTR->PDORs.PDOR7
#define PTC8_OUT     PTC_BASE_PTR->PDORs.PDOR8
#define PTC9_OUT     PTC_BASE_PTR->PDORs.PDOR9
#define PTC10_OUT    PTC_BASE_PTR->PDORs.PDOR10
#define PTC11_OUT    PTC_BASE_PTR->PDORs.PDOR11
#define PTC12_OUT    PTC_BASE_PTR->PDORs.PDOR12
#define PTC13_OUT    PTC_BASE_PTR->PDORs.PDOR13
#define PTC14_OUT    PTC_BASE_PTR->PDORs.PDOR14
#define PTC15_OUT    PTC_BASE_PTR->PDORs.PDOR15
#define PTC16_OUT    PTC_BASE_PTR->PDORs.PDOR16
#define PTC17_OUT    PTC_BASE_PTR->PDORs.PDOR17
#define PTC18_OUT    PTC_BASE_PTR->PDORs.PDOR18
#define PTC19_OUT    PTC_BASE_PTR->PDORs.PDOR19
#define PTC20_OUT    PTC_BASE_PTR->PDORs.PDOR20
#define PTC21_OUT    PTC_BASE_PTR->PDORs.PDOR21
#define PTC22_OUT    PTC_BASE_PTR->PDORs.PDOR22
#define PTC23_OUT    PTC_BASE_PTR->PDORs.PDOR23
#define PTC24_OUT    PTC_BASE_PTR->PDORs.PDOR24
#define PTC25_OUT    PTC_BASE_PTR->PDORs.PDOR25
#define PTC26_OUT    PTC_BASE_PTR->PDORs.PDOR26
#define PTC27_OUT    PTC_BASE_PTR->PDORs.PDOR27
#define PTC28_OUT    PTC_BASE_PTR->PDORs.PDOR28
#define PTC29_OUT    PTC_BASE_PTR->PDORs.PDOR29
#define PTC30_OUT    PTC_BASE_PTR->PDORs.PDOR30
#define PTC31_OUT    PTC_BASE_PTR->PDORs.PDOR31

/* Define the port of PTD */
#define PTD0_OUT     PTD_BASE_PTR->PDORs.PDOR0
#define PTD1_OUT     PTD_BASE_PTR->PDORs.PDOR1
#define PTD2_OUT     PTD_BASE_PTR->PDORs.PDOR2
#define PTD3_OUT     PTD_BASE_PTR->PDORs.PDOR3
#define PTD4_OUT     PTD_BASE_PTR->PDORs.PDOR4
#define PTD5_OUT     PTD_BASE_PTR->PDORs.PDOR5
#define PTD6_OUT     PTD_BASE_PTR->PDORs.PDOR6
#define PTD7_OUT     PTD_BASE_PTR->PDORs.PDOR7
#define PTD8_OUT     PTD_BASE_PTR->PDORs.PDOR8
#define PTD9_OUT     PTD_BASE_PTR->PDORs.PDOR9
#define PTD10_OUT    PTD_BASE_PTR->PDORs.PDOR10
#define PTD11_OUT    PTD_BASE_PTR->PDORs.PDOR11
#define PTD12_OUT    PTD_BASE_PTR->PDORs.PDOR12
#define PTD13_OUT    PTD_BASE_PTR->PDORs.PDOR13
#define PTD14_OUT    PTD_BASE_PTR->PDORs.PDOR14
#define PTD15_OUT    PTD_BASE_PTR->PDORs.PDOR15
#define PTD16_OUT    PTD_BASE_PTR->PDORs.PDOR16
#define PTD17_OUT    PTD_BASE_PTR->PDORs.PDOR17
#define PTD18_OUT    PTD_BASE_PTR->PDORs.PDOR18
#define PTD19_OUT    PTD_BASE_PTR->PDORs.PDOR19
#define PTD20_OUT    PTD_BASE_PTR->PDORs.PDOR20
#define PTD21_OUT    PTD_BASE_PTR->PDORs.PDOR21
#define PTD22_OUT    PTD_BASE_PTR->PDORs.PDOR22
#define PTD23_OUT    PTD_BASE_PTR->PDORs.PDOR23
#define PTD24_OUT    PTD_BASE_PTR->PDORs.PDOR24
#define PTD25_OUT    PTD_BASE_PTR->PDORs.PDOR25
#define PTD26_OUT    PTD_BASE_PTR->PDORs.PDOR26
#define PTD27_OUT    PTD_BASE_PTR->PDORs.PDOR27
#define PTD28_OUT    PTD_BASE_PTR->PDORs.PDOR28
#define PTD29_OUT    PTD_BASE_PTR->PDORs.PDOR29
#define PTD30_OUT    PTD_BASE_PTR->PDORs.PDOR30
#define PTD31_OUT    PTD_BASE_PTR->PDORs.PDOR31

/* Define the port of PTE */
#define PTE0_OUT     PTE_BASE_PTR->PDORs.PDOR0
#define PTE1_OUT     PTE_BASE_PTR->PDORs.PDOR1
#define PTE2_OUT     PTE_BASE_PTR->PDORs.PDOR2
#define PTE3_OUT     PTE_BASE_PTR->PDORs.PDOR3
#define PTE4_OUT     PTE_BASE_PTR->PDORs.PDOR4
#define PTE5_OUT     PTE_BASE_PTR->PDORs.PDOR5
#define PTE6_OUT     PTE_BASE_PTR->PDORs.PDOR6
#define PTE7_OUT     PTE_BASE_PTR->PDORs.PDOR7
#define PTE8_OUT     PTE_BASE_PTR->PDORs.PDOR8
#define PTE9_OUT     PTE_BASE_PTR->PDORs.PDOR9
#define PTE10_OUT    PTE_BASE_PTR->PDORs.PDOR10
#define PTE11_OUT    PTE_BASE_PTR->PDORs.PDOR11
#define PTE12_OUT    PTE_BASE_PTR->PDORs.PDOR12
#define PTE13_OUT    PTE_BASE_PTR->PDORs.PDOR13
#define PTE14_OUT    PTE_BASE_PTR->PDORs.PDOR14
#define PTE15_OUT    PTE_BASE_PTR->PDORs.PDOR15
#define PTE16_OUT    PTE_BASE_PTR->PDORs.PDOR16
#define PTE17_OUT    PTE_BASE_PTR->PDORs.PDOR17
#define PTE18_OUT    PTE_BASE_PTR->PDORs.PDOR18
#define PTE19_OUT    PTE_BASE_PTR->PDORs.PDOR19
#define PTE20_OUT    PTE_BASE_PTR->PDORs.PDOR20
#define PTE21_OUT    PTE_BASE_PTR->PDORs.PDOR21
#define PTE22_OUT    PTE_BASE_PTR->PDORs.PDOR22
#define PTE23_OUT    PTE_BASE_PTR->PDORs.PDOR23
#define PTE24_OUT    PTE_BASE_PTR->PDORs.PDOR24
#define PTE25_OUT    PTE_BASE_PTR->PDORs.PDOR25
#define PTE26_OUT    PTE_BASE_PTR->PDORs.PDOR26
#define PTE27_OUT    PTE_BASE_PTR->PDORs.PDOR27
#define PTE28_OUT    PTE_BASE_PTR->PDORs.PDOR28
#define PTE29_OUT    PTE_BASE_PTR->PDORs.PDOR29
#define PTE30_OUT    PTE_BASE_PTR->PDORs.PDOR30
#define PTE31_OUT    PTE_BASE_PTR->PDORs.PDOR31

/* Define the input and output direction of PTA */
#define DDRA0       PTA_BASE_PTR->DDRs.DDR0
#define DDRA1       PTA_BASE_PTR->DDRs.DDR1
#define DDRA2       PTA_BASE_PTR->DDRs.DDR2
#define DDRA3       PTA_BASE_PTR->DDRs.DDR3
#define DDRA4       PTA_BASE_PTR->DDRs.DDR4
#define DDRA5       PTA_BASE_PTR->DDRs.DDR5
#define DDRA6       PTA_BASE_PTR->DDRs.DDR6
#define DDRA7       PTA_BASE_PTR->DDRs.DDR7
#define DDRA8       PTA_BASE_PTR->DDRs.DDR8
#define DDRA9       PTA_BASE_PTR->DDRs.DDR9
#define DDRA10      PTA_BASE_PTR->DDRs.DDR10
#define DDRA11      PTA_BASE_PTR->DDRs.DDR11
#define DDRA12      PTA_BASE_PTR->DDRs.DDR12
#define DDRA13      PTA_BASE_PTR->DDRs.DDR13
#define DDRA14      PTA_BASE_PTR->DDRs.DDR14
#define DDRA15      PTA_BASE_PTR->DDRs.DDR15
#define DDRA16      PTA_BASE_PTR->DDRs.DDR16
#define DDRA17      PTA_BASE_PTR->DDRs.DDR17
#define DDRA18      PTA_BASE_PTR->DDRs.DDR18
#define DDRA19      PTA_BASE_PTR->DDRs.DDR19
#define DDRA20      PTA_BASE_PTR->DDRs.DDR20
#define DDRA21      PTA_BASE_PTR->DDRs.DDR21
#define DDRA22      PTA_BASE_PTR->DDRs.DDR22
#define DDRA23      PTA_BASE_PTR->DDRs.DDR23
#define DDRA24      PTA_BASE_PTR->DDRs.DDR24
#define DDRA25      PTA_BASE_PTR->DDRs.DDR25
#define DDRA26      PTA_BASE_PTR->DDRs.DDR26
#define DDRA27      PTA_BASE_PTR->DDRs.DDR27
#define DDRA28      PTA_BASE_PTR->DDRs.DDR28
#define DDRA29      PTA_BASE_PTR->DDRs.DDR29
#define DDRA30      PTA_BASE_PTR->DDRs.DDR30
#define DDRA31      PTA_BASE_PTR->DDRs.DDR31

/* Define the input and output direction of PTB */
#define DDRB0       PTB_BASE_PTR->DDRs.DDR0
#define DDRB1       PTB_BASE_PTR->DDRs.DDR1
#define DDRB2       PTB_BASE_PTR->DDRs.DDR2
#define DDRB3       PTB_BASE_PTR->DDRs.DDR3
#define DDRB4       PTB_BASE_PTR->DDRs.DDR4
#define DDRB5       PTB_BASE_PTR->DDRs.DDR5
#define DDRB6       PTB_BASE_PTR->DDRs.DDR6
#define DDRB7       PTB_BASE_PTR->DDRs.DDR7
#define DDRB8       PTB_BASE_PTR->DDRs.DDR8
#define DDRB9       PTB_BASE_PTR->DDRs.DDR9
#define DDRB10      PTB_BASE_PTR->DDRs.DDR10
#define DDRB11      PTB_BASE_PTR->DDRs.DDR11
#define DDRB12      PTB_BASE_PTR->DDRs.DDR12
#define DDRB13      PTB_BASE_PTR->DDRs.DDR13
#define DDRB14      PTB_BASE_PTR->DDRs.DDR14
#define DDRB15      PTB_BASE_PTR->DDRs.DDR15
#define DDRB16      PTB_BASE_PTR->DDRs.DDR16
#define DDRB17      PTB_BASE_PTR->DDRs.DDR17
#define DDRB18      PTB_BASE_PTR->DDRs.DDR18
#define DDRB19      PTB_BASE_PTR->DDRs.DDR19
#define DDRB20      PTB_BASE_PTR->DDRs.DDR20
#define DDRB21      PTB_BASE_PTR->DDRs.DDR21
#define DDRB22      PTB_BASE_PTR->DDRs.DDR22
#define DDRB23      PTB_BASE_PTR->DDRs.DDR23
#define DDRB24      PTB_BASE_PTR->DDRs.DDR24
#define DDRB25      PTB_BASE_PTR->DDRs.DDR25
#define DDRB26      PTB_BASE_PTR->DDRs.DDR26
#define DDRB27      PTB_BASE_PTR->DDRs.DDR27
#define DDRB28      PTB_BASE_PTR->DDRs.DDR28
#define DDRB29      PTB_BASE_PTR->DDRs.DDR29
#define DDRB30      PTB_BASE_PTR->DDRs.DDR30
#define DDRB31      PTB_BASE_PTR->DDRs.DDR31

