JuaBue/S32K144_basic/include/driver/S32K_GPIO.h
/* Define the input and output direction of PTC */
#define DDRC0       PTC_BASE_PTR->DDRs.DDR0
#define DDRC1       PTC_BASE_PTR->DDRs.DDR1
#define DDRC2       PTC_BASE_PTR->DDRs.DDR2
#define DDRC3       PTC_BASE_PTR->DDRs.DDR3
#define DDRC4       PTC_BASE_PTR->DDRs.DDR4
#define DDRC5       PTC_BASE_PTR->DDRs.DDR5
#define DDRC6       PTC_BASE_PTR->DDRs.DDR6
#define DDRC7       PTC_BASE_PTR->DDRs.DDR7
#define DDRC8       PTC_BASE_PTR->DDRs.DDR8
#define DDRC9       PTC_BASE_PTR->DDRs.DDR9
#define DDRC10      PTC_BASE_PTR->DDRs.DDR10
#define DDRC11      PTC_BASE_PTR->DDRs.DDR11
#define DDRC12      PTC_BASE_PTR->DDRs.DDR12
#define DDRC13      PTC_BASE_PTR->DDRs.DDR13
#define DDRC14      PTC_BASE_PTR->DDRs.DDR14
#define DDRC15      PTC_BASE_PTR->DDRs.DDR15
#define DDRC16      PTC_BASE_PTR->DDRs.DDR16
#define DDRC17      PTC_BASE_PTR->DDRs.DDR17
#define DDRC18      PTC_BASE_PTR->DDRs.DDR18
#define DDRC19      PTC_BASE_PTR->DDRs.DDR19
#define DDRC20      PTC_BASE_PTR->DDRs.DDR20
#define DDRC21      PTC_BASE_PTR->DDRs.DDR21
#define DDRC22      PTC_BASE_PTR->DDRs.DDR22
#define DDRC23      PTC_BASE_PTR->DDRs.DDR23
#define DDRC24      PTC_BASE_PTR->DDRs.DDR24
#define DDRC25      PTC_BASE_PTR->DDRs.DDR25
#define DDRC26      PTC_BASE_PTR->DDRs.DDR26
#define DDRC27      PTC_BASE_PTR->DDRs.DDR27
#define DDRC28      PTC_BASE_PTR->DDRs.DDR28
#define DDRC29      PTC_BASE_PTR->DDRs.DDR29
#define DDRC30      PTC_BASE_PTR->DDRs.DDR30
#define DDRC31      PTC_BASE_PTR->DDRs.DDR31

/* Define the input and output direction of PTD */
#define DDRD0       PTD_BASE_PTR->DDRs.DDR0
#define DDRD1       PTD_BASE_PTR->DDRs.DDR1
#define DDRD2       PTD_BASE_PTR->DDRs.DDR2
#define DDRD3       PTD_BASE_PTR->DDRs.DDR3
#define DDRD4       PTD_BASE_PTR->DDRs.DDR4
#define DDRD5       PTD_BASE_PTR->DDRs.DDR5
#define DDRD6       PTD_BASE_PTR->DDRs.DDR6
#define DDRD7       PTD_BASE_PTR->DDRs.DDR7
#define DDRD8       PTD_BASE_PTR->DDRs.DDR8
#define DDRD9       PTD_BASE_PTR->DDRs.DDR9
#define DDRD10      PTD_BASE_PTR->DDRs.DDR10
#define DDRD11      PTD_BASE_PTR->DDRs.DDR11
#define DDRD12      PTD_BASE_PTR->DDRs.DDR12
#define DDRD13      PTD_BASE_PTR->DDRs.DDR13
#define DDRD14      PTD_BASE_PTR->DDRs.DDR14
#define DDRD15      PTD_BASE_PTR->DDRs.DDR15
#define DDRD16      PTD_BASE_PTR->DDRs.DDR16
#define DDRD17      PTD_BASE_PTR->DDRs.DDR17
#define DDRD18      PTD_BASE_PTR->DDRs.DDR18
#define DDRD19      PTD_BASE_PTR->DDRs.DDR19
#define DDRD20      PTD_BASE_PTR->DDRs.DDR20
#define DDRD21      PTD_BASE_PTR->DDRs.DDR21
#define DDRD22      PTD_BASE_PTR->DDRs.DDR22
#define DDRD23      PTD_BASE_PTR->DDRs.DDR23
#define DDRD24      PTD_BASE_PTR->DDRs.DDR24
#define DDRD25      PTD_BASE_PTR->DDRs.DDR25
#define DDRD26      PTD_BASE_PTR->DDRs.DDR26
#define DDRD27      PTD_BASE_PTR->DDRs.DDR27
#define DDRD28      PTD_BASE_PTR->DDRs.DDR28
#define DDRD29      PTD_BASE_PTR->DDRs.DDR29
#define DDRD30      PTD_BASE_PTR->DDRs.DDR30
#define DDRD31      PTD_BASE_PTR->DDRs.DDR31

/* Define the input and output direction of PTE */
#define DDRE0       PTE_BASE_PTR->DDRs.DDR0
#define DDRE1       PTE_BASE_PTR->DDRs.DDR1
#define DDRE2       PTE_BASE_PTR->DDRs.DDR2
#define DDRE3       PTE_BASE_PTR->DDRs.DDR3
#define DDRE4       PTE_BASE_PTR->DDRs.DDR4
#define DDRE5       PTE_BASE_PTR->DDRs.DDR5
#define DDRE6       PTE_BASE_PTR->DDRs.DDR6
#define DDRE7       PTE_BASE_PTR->DDRs.DDR7
#define DDRE8       PTE_BASE_PTR->DDRs.DDR8
#define DDRE9       PTE_BASE_PTR->DDRs.DDR9
#define DDRE10      PTE_BASE_PTR->DDRs.DDR10
#define DDRE11      PTE_BASE_PTR->DDRs.DDR11
#define DDRE12      PTE_BASE_PTR->DDRs.DDR12
#define DDRE13      PTE_BASE_PTR->DDRs.DDR13
#define DDRE14      PTE_BASE_PTR->DDRs.DDR14
#define DDRE15      PTE_BASE_PTR->DDRs.DDR15
#define DDRE16      PTE_BASE_PTR->DDRs.DDR16
#define DDRE17      PTE_BASE_PTR->DDRs.DDR17
#define DDRE18      PTE_BASE_PTR->DDRs.DDR18
#define DDRE19      PTE_BASE_PTR->DDRs.DDR19
#define DDRE20      PTE_BASE_PTR->DDRs.DDR20
#define DDRE21      PTE_BASE_PTR->DDRs.DDR21
#define DDRE22      PTE_BASE_PTR->DDRs.DDR22
#define DDRE23      PTE_BASE_PTR->DDRs.DDR23
#define DDRE24      PTE_BASE_PTR->DDRs.DDR24
#define DDRE25      PTE_BASE_PTR->DDRs.DDR25
#define DDRE26      PTE_BASE_PTR->DDRs.DDR26
#define DDRE27      PTE_BASE_PTR->DDRs.DDR27
#define DDRE28      PTE_BASE_PTR->DDRs.DDR28
#define DDRE29      PTE_BASE_PTR->DDRs.DDR29
#define DDRE30      PTE_BASE_PTR->DDRs.DDR30
#define DDRE31      PTE_BASE_PTR->DDRs.DDR31

/* Define the input port of PTA */
#define PTA0_IN     PTA_BASE_PTR->PDIRs.PDIR0
#define PTA1_IN     PTA_BASE_PTR->PDIRs.PDIR1
#define PTA2_IN     PTA_BASE_PTR->PDIRs.PDIR2
#define PTA3_IN     PTA_BASE_PTR->PDIRs.PDIR3
#define PTA4_IN     PTA_BASE_PTR->PDIRs.PDIR4
#define PTA5_IN     PTA_BASE_PTR->PDIRs.PDIR5
#define PTA6_IN     PTA_BASE_PTR->PDIRs.PDIR6
#define PTA7_IN     PTA_BASE_PTR->PDIRs.PDIR7
#define PTA8_IN     PTA_BASE_PTR->PDIRs.PDIR8
#define PTA9_IN     PTA_BASE_PTR->PDIRs.PDIR9
#define PTA10_IN    PTA_BASE_PTR->PDIRs.PDIR10
#define PTA11_IN    PTA_BASE_PTR->PDIRs.PDIR11
#define PTA12_IN    PTA_BASE_PTR->PDIRs.PDIR12
#define PTA13_IN    PTA_BASE_PTR->PDIRs.PDIR13
#define PTA14_IN    PTA_BASE_PTR->PDIRs.PDIR14
#define PTA15_IN    PTA_BASE_PTR->PDIRs.PDIR15
#define PTA16_IN    PTA_BASE_PTR->PDIRs.PDIR16
#define PTA17_IN    PTA_BASE_PTR->PDIRs.PDIR17
#define PTA18_IN    PTA_BASE_PTR->PDIRs.PDIR18
#define PTA19_IN    PTA_BASE_PTR->PDIRs.PDIR19
#define PTA20_IN    PTA_BASE_PTR->PDIRs.PDIR20
#define PTA21_IN    PTA_BASE_PTR->PDIRs.PDIR21
#define PTA22_IN    PTA_BASE_PTR->PDIRs.PDIR22
#define PTA23_IN    PTA_BASE_PTR->PDIRs.PDIR23
#define PTA24_IN    PTA_BASE_PTR->PDIRs.PDIR24
#define PTA25_IN    PTA_BASE_PTR->PDIRs.PDIR25
#define PTA26_IN    PTA_BASE_PTR->PDIRs.PDIR26
#define PTA27_IN    PTA_BASE_PTR->PDIRs.PDIR27
#define PTA28_IN    PTA_BASE_PTR->PDIRs.PDIR28
#define PTA29_IN    PTA_BASE_PTR->PDIRs.PDIR29
#define PTA30_IN    PTA_BASE_PTR->PDIRs.PDIR30
#define PTA31_IN    PTA_BASE_PTR->PDIRs.PDIR31

/* Define the input port of PTB */
#define PTB0_IN     PTB_BASE_PTR->PDIRs.PDIR0
#define PTB1_IN     PTB_BASE_PTR->PDIRs.PDIR1
#define PTB2_IN     PTB_BASE_PTR->PDIRs.PDIR2
#define PTB3_IN     PTB_BASE_PTR->PDIRs.PDIR3
#define PTB4_IN     PTB_BASE_PTR->PDIRs.PDIR4
#define PTB5_IN     PTB_BASE_PTR->PDIRs.PDIR5
#define PTB6_IN     PTB_BASE_PTR->PDIRs.PDIR6
#define PTB7_IN     PTB_BASE_PTR->PDIRs.PDIR7
#define PTB8_IN     PTB_BASE_PTR->PDIRs.PDIR8
#define PTB9_IN     PTB_BASE_PTR->PDIRs.PDIR9
#define PTB10_IN    PTB_BASE_PTR->PDIRs.PDIR10
#define PTB11_IN    PTB_BASE_PTR->PDIRs.PDIR11
#define PTB12_IN    PTB_BASE_PTR->PDIRs.PDIR12
#define PTB13_IN    PTB_BASE_PTR->PDIRs.PDIR13
#define PTB14_IN    PTB_BASE_PTR->PDIRs.PDIR14
#define PTB15_IN    PTB_BASE_PTR->PDIRs.PDIR15
#define PTB16_IN    PTB_BASE_PTR->PDIRs.PDIR16
#define PTB17_IN    PTB_BASE_PTR->PDIRs.PDIR17
#define PTB18_IN    PTB_BASE_PTR->PDIRs.PDIR18
#define PTB19_IN    PTB_BASE_PTR->PDIRs.PDIR19
#define PTB20_IN    PTB_BASE_PTR->PDIRs.PDIR20
#define PTB21_IN    PTB_BASE_PTR->PDIRs.PDIR21
#define PTB22_IN    PTB_BASE_PTR->PDIRs.PDIR22
#define PTB23_IN    PTB_BASE_PTR->PDIRs.PDIR23
#define PTB24_IN    PTB_BASE_PTR->PDIRs.PDIR24
#define PTB25_IN    PTB_BASE_PTR->PDIRs.PDIR25
#define PTB26_IN    PTB_BASE_PTR->PDIRs.PDIR26
#define PTB27_IN    PTB_BASE_PTR->PDIRs.PDIR27
#define PTB28_IN    PTB_BASE_PTR->PDIRs.PDIR28
#define PTB29_IN    PTB_BASE_PTR->PDIRs.PDIR29
#define PTB30_IN    PTB_BASE_PTR->PDIRs.PDIR30
#define PTB31_IN    PTB_BASE_PTR->PDIRs.PDIR31

/* Define the input port of PTC */
#define PTC0_IN     PTC_BASE_PTR->PDIRs.PDIR0
#define PTC1_IN     PTC_BASE_PTR->PDIRs.PDIR1
#define PTC2_IN     PTC_BASE_PTR->PDIRs.PDIR2
#define PTC3_IN     PTC_BASE_PTR->PDIRs.PDIR3
#define PTC4_IN     PTC_BASE_PTR->PDIRs.PDIR4
#define PTC5_IN     PTC_BASE_PTR->PDIRs.PDIR5
#define PTC6_IN     PTC_BASE_PTR->PDIRs.PDIR6
#define PTC7_IN     PTC_BASE_PTR->PDIRs.PDIR7
#define PTC8_IN     PTC_BASE_PTR->PDIRs.PDIR8
#define PTC9_IN     PTC_BASE_PTR->PDIRs.PDIR9
#define PTC10_IN    PTC_BASE_PTR->PDIRs.PDIR10
#define PTC11_IN    PTC_BASE_PTR->PDIRs.PDIR11
#define PTC12_IN    PTC_BASE_PTR->PDIRs.PDIR12
#define PTC13_IN    PTC_BASE_PTR->PDIRs.PDIR13
#define PTC14_IN    PTC_BASE_PTR->PDIRs.PDIR14
#define PTC15_IN    PTC_BASE_PTR->PDIRs.PDIR15
#define PTC16_IN    PTC_BASE_PTR->PDIRs.PDIR16
#define PTC17_IN    PTC_BASE_PTR->PDIRs.PDIR17
#define PTC18_IN    PTC_BASE_PTR->PDIRs.PDIR18
#define PTC19_IN    PTC_BASE_PTR->PDIRs.PDIR19
#define PTC20_IN    PTC_BASE_PTR->PDIRs.PDIR20
#define PTC21_IN    PTC_BASE_PTR->PDIRs.PDIR21
#define PTC22_IN    PTC_BASE_PTR->PDIRs.PDIR22
#define PTC23_IN    PTC_BASE_PTR->PDIRs.PDIR23
#define PTC24_IN    PTC_BASE_PTR->PDIRs.PDIR24
#define PTC25_IN    PTC_BASE_PTR->PDIRs.PDIR25
#define PTC26_IN    PTC_BASE_PTR->PDIRs.PDIR26
#define PTC27_IN    PTC_BASE_PTR->PDIRs.PDIR27
#define PTC28_IN    PTC_BASE_PTR->PDIRs.PDIR28
#define PTC29_IN    PTC_BASE_PTR->PDIRs.PDIR29
#define PTC30_IN    PTC_BASE_PTR->PDIRs.PDIR30
#define PTC31_IN    PTC_BASE_PTR->PDIRs.PDIR31

