JuaBue/S32K144_basic/include/driver/S32K_GPIO.h
/* Define the input port of PTD */
#define PTD0_IN     PTD_BASE_PTR->PDIRs.PDIR0
#define PTD1_IN     PTD_BASE_PTR->PDIRs.PDIR1
#define PTD2_IN     PTD_BASE_PTR->PDIRs.PDIR2
#define PTD3_IN     PTD_BASE_PTR->PDIRs.PDIR3
#define PTD4_IN     PTD_BASE_PTR->PDIRs.PDIR4
#define PTD5_IN     PTD_BASE_PTR->PDIRs.PDIR5
#define PTD6_IN     PTD_BASE_PTR->PDIRs.PDIR6
#define PTD7_IN     PTD_BASE_PTR->PDIRs.PDIR7
#define PTD8_IN     PTD_BASE_PTR->PDIRs.PDIR8
#define PTD9_IN     PTD_BASE_PTR->PDIRs.PDIR9
#define PTD10_IN    PTD_BASE_PTR->PDIRs.PDIR10
#define PTD11_IN    PTD_BASE_PTR->PDIRs.PDIR11
#define PTD12_IN    PTD_BASE_PTR->PDIRs.PDIR12
#define PTD13_IN    PTD_BASE_PTR->PDIRs.PDIR13
#define PTD14_IN    PTD_BASE_PTR->PDIRs.PDIR14
#define PTD15_IN    PTD_BASE_PTR->PDIRs.PDIR15
#define PTD16_IN    PTD_BASE_PTR->PDIRs.PDIR16
#define PTD17_IN    PTD_BASE_PTR->PDIRs.PDIR17
#define PTD18_IN    PTD_BASE_PTR->PDIRs.PDIR18
#define PTD19_IN    PTD_BASE_PTR->PDIRs.PDIR19
#define PTD20_IN    PTD_BASE_PTR->PDIRs.PDIR20
#define PTD21_IN    PTD_BASE_PTR->PDIRs.PDIR21
#define PTD22_IN    PTD_BASE_PTR->PDIRs.PDIR22
#define PTD23_IN    PTD_BASE_PTR->PDIRs.PDIR23
#define PTD24_IN    PTD_BASE_PTR->PDIRs.PDIR24
#define PTD25_IN    PTD_BASE_PTR->PDIRs.PDIR25
#define PTD26_IN    PTD_BASE_PTR->PDIRs.PDIR26
#define PTD27_IN    PTD_BASE_PTR->PDIRs.PDIR27
#define PTD28_IN    PTD_BASE_PTR->PDIRs.PDIR28
#define PTD29_IN    PTD_BASE_PTR->PDIRs.PDIR29
#define PTD30_IN    PTD_BASE_PTR->PDIRs.PDIR30
#define PTD31_IN    PTD_BASE_PTR->PDIRs.PDIR31

/* Define the input port of PTE */
#define PTE0_IN     PTE_BASE_PTR->PDIRs.PDIR0
#define PTE1_IN     PTE_BASE_PTR->PDIRs.PDIR1
#define PTE2_IN     PTE_BASE_PTR->PDIRs.PDIR2
#define PTE3_IN     PTE_BASE_PTR->PDIRs.PDIR3
#define PTE4_IN     PTE_BASE_PTR->PDIRs.PDIR4
#define PTE5_IN     PTE_BASE_PTR->PDIRs.PDIR5
#define PTE6_IN     PTE_BASE_PTR->PDIRs.PDIR6
#define PTE7_IN     PTE_BASE_PTR->PDIRs.PDIR7
#define PTE8_IN     PTE_BASE_PTR->PDIRs.PDIR8
#define PTE9_IN     PTE_BASE_PTR->PDIRs.PDIR9
#define PTE10_IN    PTE_BASE_PTR->PDIRs.PDIR10
#define PTE11_IN    PTE_BASE_PTR->PDIRs.PDIR11
#define PTE12_IN    PTE_BASE_PTR->PDIRs.PDIR12
#define PTE13_IN    PTE_BASE_PTR->PDIRs.PDIR13
#define PTE14_IN    PTE_BASE_PTR->PDIRs.PDIR14
#define PTE15_IN    PTE_BASE_PTR->PDIRs.PDIR15
#define PTE16_IN    PTE_BASE_PTR->PDIRs.PDIR16
#define PTE17_IN    PTE_BASE_PTR->PDIRs.PDIR17
#define PTE18_IN    PTE_BASE_PTR->PDIRs.PDIR18
#define PTE19_IN    PTE_BASE_PTR->PDIRs.PDIR19
#define PTE20_IN    PTE_BASE_PTR->PDIRs.PDIR20
#define PTE21_IN    PTE_BASE_PTR->PDIRs.PDIR21
#define PTE22_IN    PTE_BASE_PTR->PDIRs.PDIR22
#define PTE23_IN    PTE_BASE_PTR->PDIRs.PDIR23
#define PTE24_IN    PTE_BASE_PTR->PDIRs.PDIR24
#define PTE25_IN    PTE_BASE_PTR->PDIRs.PDIR25
#define PTE26_IN    PTE_BASE_PTR->PDIRs.PDIR26
#define PTE27_IN    PTE_BASE_PTR->PDIRs.PDIR27
#define PTE28_IN    PTE_BASE_PTR->PDIRs.PDIR28
#define PTE29_IN    PTE_BASE_PTR->PDIRs.PDIR29
#define PTE30_IN    PTE_BASE_PTR->PDIRs.PDIR30
#define PTE31_IN    PTE_BASE_PTR->PDIRs.PDIR31

/* Defines the 8-bit port of PTA */
#define PTA_BYTE0_OUT   PTA_BASE_PTR->PDORByte.Byte0
#define PTA_BYTE1_OUT   PTA_BASE_PTR->PDORByte.Byte1
#define PTA_BYTE2_OUT   PTA_BASE_PTR->PDORByte.Byte2
#define PTA_BYTE3_OUT   PTA_BASE_PTR->PDORByte.Byte3

/* Defines the 8-bit port of PTB */
#define PTB_BYTE0_OUT   PTB_BASE_PTR->PDORByte.Byte0
#define PTB_BYTE1_OUT   PTB_BASE_PTR->PDORByte.Byte1
#define PTB_BYTE2_OUT   PTB_BASE_PTR->PDORByte.Byte2
#define PTB_BYTE3_OUT   PTB_BASE_PTR->PDORByte.Byte3

/* Defines the 8-bit port of PTC */
#define PTC_BYTE0_OUT   PTC_BASE_PTR->PDORByte.Byte0
#define PTC_BYTE1_OUT   PTC_BASE_PTR->PDORByte.Byte1
#define PTC_BYTE2_OUT   PTC_BASE_PTR->PDORByte.Byte2
#define PTC_BYTE3_OUT   PTC_BASE_PTR->PDORByte.Byte3

/* Defines the 8-bit port of PTD */
#define PTD_BYTE0_OUT   PTD_BASE_PTR->PDORByte.Byte0
#define PTD_BYTE1_OUT   PTD_BASE_PTR->PDORByte.Byte1
#define PTD_BYTE2_OUT   PTD_BASE_PTR->PDORByte.Byte2
#define PTD_BYTE3_OUT   PTD_BASE_PTR->PDORByte.Byte3

/* Defines the 8-bit port of PTE */
#define PTE_BYTE0_OUT   PTE_BASE_PTR->PDORByte.Byte0
#define PTE_BYTE1_OUT   PTE_BASE_PTR->PDORByte.Byte1
#define PTE_BYTE2_OUT   PTE_BASE_PTR->PDORByte.Byte2
#define PTE_BYTE3_OUT   PTE_BASE_PTR->PDORByte.Byte3

/* Define the 8-bit input and output direction of PTA */
#define DDRA_BYTE0      PTA_BASE_PTR->DDRByte.Byte0
#define DDRA_BYTE1      PTA_BASE_PTR->DDRByte.Byte1
#define DDRA_BYTE2      PTA_BASE_PTR->DDRByte.Byte2
#define DDRA_BYTE3      PTA_BASE_PTR->DDRByte.Byte3

/* Define the 8-bit input and output direction of PTB */
#define DDRB_BYTE0      PTB_BASE_PTR->DDRByte.Byte0
#define DDRB_BYTE1      PTB_BASE_PTR->DDRByte.Byte1
#define DDRB_BYTE2      PTB_BASE_PTR->DDRByte.Byte2
#define DDRB_BYTE3      PTB_BASE_PTR->DDRByte.Byte3

/* Define the 8-bit input and output direction of PTC */
#define DDRC_BYTE0      PTC_BASE_PTR->DDRByte.Byte0
#define DDRC_BYTE1      PTC_BASE_PTR->DDRByte.Byte1
#define DDRC_BYTE2      PTC_BASE_PTR->DDRByte.Byte2
#define DDRC_BYTE3      PTC_BASE_PTR->DDRByte.Byte3

/* Define the 8-bit input and output direction of PTD */
#define DDRD_BYTE0      PTD_BASE_PTR->DDRByte.Byte0
#define DDRD_BYTE1      PTD_BASE_PTR->DDRByte.Byte1
#define DDRD_BYTE2      PTD_BASE_PTR->DDRByte.Byte2
#define DDRD_BYTE3      PTD_BASE_PTR->DDRByte.Byte3

/* Define the 8-bit input and output direction of PTE */
#define DDRE_BYTE0      PTE_BASE_PTR->DDRByte.Byte0
#define DDRE_BYTE1      PTE_BASE_PTR->DDRByte.Byte1
#define DDRE_BYTE2      PTE_BASE_PTR->DDRByte.Byte2
#define DDRE_BYTE3      PTE_BASE_PTR->DDRByte.Byte3

/* Defines the 8-bit input port of PTA */
#define PTA_BYTE0_IN    PTA_BASE_PTR->PDIRByte.Byte0
#define PTA_BYTE1_IN    PTA_BASE_PTR->PDIRByte.Byte1
#define PTA_BYTE2_IN    PTA_BASE_PTR->PDIRByte.Byte2
#define PTA_BYTE3_IN    PTA_BASE_PTR->PDIRByte.Byte3

/* Defines the 8-bit input port of PTB */
#define PTB_BYTE0_IN    PTB_BASE_PTR->PDIRByte.Byte0
#define PTB_BYTE1_IN    PTB_BASE_PTR->PDIRByte.Byte1
#define PTB_BYTE2_IN    PTB_BASE_PTR->PDIRByte.Byte2
#define PTB_BYTE3_IN    PTB_BASE_PTR->PDIRByte.Byte3

/* Defines the 8-bit input port of PTC */
#define PTC_BYTE0_IN    PTC_BASE_PTR->PDIRByte.Byte0
#define PTC_BYTE1_IN    PTC_BASE_PTR->PDIRByte.Byte1
#define PTC_BYTE2_IN    PTC_BASE_PTR->PDIRByte.Byte2
#define PTC_BYTE3_IN    PTC_BASE_PTR->PDIRByte.Byte3

/* Defines the 8-bit input port of PTD */
#define PTD_BYTE0_IN    PTD_BASE_PTR->PDIRByte.Byte0
#define PTD_BYTE1_IN    PTD_BASE_PTR->PDIRByte.Byte1
#define PTD_BYTE2_IN    PTD_BASE_PTR->PDIRByte.Byte2
#define PTD_BYTE3_IN    PTD_BASE_PTR->PDIRByte.Byte3

/* Defines the 8-bit input port of PTE */
#define PTE_BYTE0_IN    PTE_BASE_PTR->PDIRByte.Byte0
#define PTE_BYTE1_IN    PTE_BASE_PTR->PDIRByte.Byte1
#define PTE_BYTE2_IN    PTE_BASE_PTR->PDIRByte.Byte2
#define PTE_BYTE3_IN    PTE_BASE_PTR->PDIRByte.Byte3

/* Defines the 16-bit port of PTA */
#define PTA_WORD0_OUT   PTA_BASE_PTR->PDORWord.Word0
#define PTA_WORD1_OUT   PTA_BASE_PTR->PDORWord.Word1

/* Defines the 16-bit port of PTB */
#define PTB_WORD0_OUT   PTB_BASE_PTR->PDORWord.Word0
#define PTB_WORD1_OUT   PTB_BASE_PTR->PDORWord.Word1

