JuaBue/S32K144_basic/include/driver/S32K_GPIO.h
/* Defines the 16-bit port of PTC */
#define PTC_WORD0_OUT   PTC_BASE_PTR->PDORWord.Word0
#define PTC_WORD1_OUT   PTC_BASE_PTR->PDORWord.Word1

/* Defines the 16-bit port of PTD */
#define PTD_WORD0_OUT   PTD_BASE_PTR->PDORWord.Word0
#define PTD_WORD1_OUT   PTD_BASE_PTR->PDORWord.Word1

/* Defines the 16-bit port of PTE */
#define PTE_WORD0_OUT   PTE_BASE_PTR->PDORWord.Word0
#define PTE_WORD1_OUT   PTE_BASE_PTR->PDORWord.Word1

/* Define the 16-bit input and output direction of PTA */
#define DDRA_WORD0      PTA_BASE_PTR->DDRWord.Word0
#define DDRA_WORD1      PTA_BASE_PTR->DDRWord.Word1

/* Define the 16-bit input and output direction of PTB */
#define DDRB_WORD0      PTB_BASE_PTR->DDRWord.Word0
#define DDRB_WORD1      PTB_BASE_PTR->DDRWord.Word1

/* Define the 16-bit input and output direction of PTC */
#define DDRC_WORD0      PTC_BASE_PTR->DDRWord.Word0
#define DDRC_WORD1      PTC_BASE_PTR->DDRWord.Word1

/* Define the 16-bit input and output direction of PTD */
#define DDRD_WORD0      PTD_BASE_PTR->DDRWord.Word0
#define DDRD_WORD1      PTD_BASE_PTR->DDRWord.Word1

/* Define the 16-bit input and output direction of PTE */
#define DDRE_WORD0      PTE_BASE_PTR->DDRWord.Word0
#define DDRE_WORD1      PTE_BASE_PTR->DDRWord.Word1

/* Defines the 16-bit input port of PTA */
#define PTA_WORD0_IN    PTA_BASE_PTR->PDIRWord.Word0
#define PTA_WORD1_IN    PTA_BASE_PTR->PDIRWord.Word1

/* Defines the 16-bit input port of PTB */
#define PTB_WORD0_IN    PTB_BASE_PTR->PDIRWord.Word0
#define PTB_WORD1_IN    PTB_BASE_PTR->PDIRWord.Word1

/* Defines the 16-bit input port of PTC */
#define PTC_WORD0_IN    PTC_BASE_PTR->PDIRWord.Word0
#define PTC_WORD1_IN    PTC_BASE_PTR->PDIRWord.Word1

/* Defines the 16-bit input port of PTD */
#define PTD_WORD0_IN    PTD_BASE_PTR->PDIRWord.Word0
#define PTD_WORD1_IN    PTD_BASE_PTR->PDIRWord.Word1

/* Defines the 16-bit input port of PTE */
#define PTE_WORD0_IN    PTE_BASE_PTR->PDIRWord.Word0
#define PTE_WORD1_IN    PTE_BASE_PTR->PDIRWord.Word1

#endif /* S32K_GPIO_H_ */
